In [1]:
#import the required python packages
import pandas as pd
from sqlalchemy import create_engine
import json
import sqlite3

In [2]:
#the path for the data.json
fn ="data.json"

In [3]:
with open(fn) as f:
    data = json.load(f)

The for loop below converts the skills field of the json data into a string for entry into the database

In [4]:
for r in data:
    r['skills']=",".join(r['skills'])

In [5]:
data =pd.DataFrame(data)

I am using sqlitte database to perform the CRUD queries on the json data.
First I created a connection to the sqllite database
Then I use the pandas method to_sql to convert the pandas dataframe to SQL table named "software_engineers"

In [6]:
engine = create_engine('sqlite://', echo=False)
data.to_sql('software_engineers', engine,if_exists='append',index=False)

The query below list the json data in a table

In [7]:
data =pd.read_sql_table(table_name='software_engineers',con=engine) 
data

            name         dob           skills        contact
0       John Doe  19-09-1973  PHP,NodeJS,HTML  123 459 678 0
1       Sam Wise  19-09-1973  PHP,NodeJS,HTML  123 459 678 0
2   Kojo Koomson  19-09-1973  PHP,NodeJS,HTML  123 459 678 0
3  Kwame Dickson  19-09-1973                   123 459 678 0
4     Kwame Menu  19-09-1973  PHP,NodeJS,HTML  123 459 678 0
5      Abi Mills  19-09-1973  PHP,NodeJS,HTML  123 459 678 0

The  code  below updates the skills field  of a software engineer by the name "Kwame Dickson"

In [8]:
#modifying a row
#For example,I am updating the skills for Kwame Dickson
data ="HTML,PHP,python"
engine.execute("UPDATE software_engineers SET skills ='PHP,Java,Python' WHERE name='Kwame Dickson'")

The updated data is shown below

In [9]:
data =pd.read_sql_table(table_name='software_engineers',con=engine) 
data

            name         dob           skills        contact
0       John Doe  19-09-1973  PHP,NodeJS,HTML  123 459 678 0
1       Sam Wise  19-09-1973  PHP,NodeJS,HTML  123 459 678 0
2   Kojo Koomson  19-09-1973  PHP,NodeJS,HTML  123 459 678 0
3  Kwame Dickson  19-09-1973  PHP,Java,Python  123 459 678 0
4     Kwame Menu  19-09-1973  PHP,NodeJS,HTML  123 459 678 0
5      Abi Mills  19-09-1973  PHP,NodeJS,HTML  123 459 678 0

The code below converts the updated sql table to json using the to_json method in pandas.The modified json file is saved as new_data.json

In [10]:
modify=pd.read_sql_table(table_name='software_engineers',con=engine) 
modify.to_json("new_data.json",orient="records")

ValueError: Invalid value 'record' for option 'orient'

Inserting a new entry into the json file.
First,I query the database with the new entry and I converted the pandas dataframe to json.

In [ ]:
#Add new data entry
engine.execute("INSERT INTO software_engineers(name, dob ,skills,contact) VALUES ('Akola Mbey Denis','04-06-1997','Java,Python,JavaScript','233501595518');")

After inserting the data entry,this is how the table looks now. A new entry for software engineer by the name "Akola Mbey Denis" has been added to the table

In [ ]:
pd.read_sql_table(table_name='software_engineers',con=engine)

In [ ]:
data =pd.read_sql_table(table_name='software_engineers',con=engine) 
data.to_json('new_data.json',orient="records")

In [ ]:
#delete an  entry from the table
engine.execute("DELETE FROM software_engineers WHERE  name ='Abi Mills';")

After deleting the software enginner by name "Abi Mills",this is how the table looks

In [ ]:
delete_operation=pd.read_sql_table(table_name='software_engineers',con=engine) 
delete_operation

In [ ]:
delete_operation.to_json('new_data.json',orient="records")

After all the CRUD operations on the json data,the new json data  is saved as "new_data.json"